Revit 2027 API
IFCData.CreateDoubleOfType Method
 Creates a double data object of the specified type.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IFCData CreateDoubleOfType(
	double value,
	string typeName
)
Public Shared Function CreateDoubleOfType (
	value As Double,
	typeName As String
) As IFCData
public:
static IFCData^ CreateDoubleOfType(
	double value,
	String^ typeName
)
static member CreateDoubleOfType :
        value : float *
        typeName : string -> IFCData
Parameters
value Double
 The double value.
typeName String
 The type name.
Return Value
IFCData
 The IFCData object.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCData Class
Autodesk.Revit.DB.IFC Namespace